{"0_How many other objects are the same size as the cube?": ["how many other objects are the same size as the cube"], "1_What number of other objects are the same size as the metal cylinder?": ["what number of other objects are the same size as the metal cylinder"], "2_What number of other objects are there of the same size as the blue metal thing?": ["what number of other objects are there of the same size as the blue metal thing"], "3_How many other things are there of the same color as the small rubber cylinder?": ["how many other thing s are there of the same color as the small rubber cylinder"], "4_What number of other things are the same color as the rubber cube?": ["what number of other thing s are the same color as the rubber cube"], "5_How many other things are there of the same color as the small rubber thing?": ["how many other thing s are there of the same color as the small rubber thing"], "6_What number of spheres have the same material as the yellow thing?": ["what number of sphere s have the same material as the yellow thing"], "7_What number of other small things have the same material as the brown thing?": ["what number of other small thing s have the same material as the brown thing"], "8_How many large cubes have the same material as the blue sphere?": ["how many large cube s have the same material as the blue sphere"], "9_What number of small metal things are the same shape as the cyan rubber thing?": ["what number of small metal thing s are the same shape as the cyan rubber thing"], "10_How many small metal things are the same shape as the large brown metal thing?": ["how many small metal thing s are the same shape as the large brown metal thing"], "11_What number of other small rubber things have the same shape as the brown thing?": ["what number of other small rubber thing s have the same shape as the brown thing"], "12_There is a gray thing that is the same size as the brown thing; what is its shape?": ["there is a gray thing that is the same size as the brown thing; what is its shape"], "13_What is the shape of the other thing that is the same size as the green thing?": ["what is the shape of the other thing that is the same size as the green thing"], "14_There is a cyan rubber thing that is the same size as the metal cylinder; what is its shape?": ["there is a cyan rubber thing that is the same size as the metal cylinder; what is its shape"], "15_What material is the thing that is the same color as the small rubber cube?": ["what material is the thing that is the same color as the small rubber cube"], "16_There is a cube that is the same color as the large metal thing; what is it made of?": ["there is a cube that is the same color as the large metal thing; what is it made of"], "17_What is the material of the sphere that is the same color as the small cube?": ["what is the material of the sphere that is the same color as the small cube"]}