{"0_How many objects are small things or cylinders?": ["how many objects are small thing s or cylinder s"], "1_What number of things are cylinders or large things?": ["what number of thing s are cylinder s or large thing s"], "2_What number of things are large cubes or cylinders?": ["what number of thing s are large cube s or cylinder s"], "3_What number of objects are small cylinders or metal things?": ["what number of objects are small cylinder s or metal thing s"], "4_What number of things are metal things or cylinders?": ["what number of thing s are metal thing s or cylinder s"], "5_What number of small things are either rubber cubes or metal things?": ["what number of small thing s are either rubber cube s or metal thing s"], "6_How many large objects are blue things or rubber cylinders?": ["how many large objects are blue thing s or rubber cylinder s"], "7_How many small objects are blue things or cubes?": ["how many small objects are blue thing s or cube s"], "8_What number of large things are either spheres or blue metal things?": ["what number of large thing s are either sphere s or blue metal thing s"], "9_What number of large objects are rubber things or spheres?": ["what number of large objects are rubber thing s or sphere s"], "10_What number of gray things are either rubber things or small things?": ["what number of gray thing s are either rubber thing s or small thing s"], "11_How many green objects are either large rubber things or large metal things?": ["how many green objects are either large rubber thing s or large metal thing s"], "12_How many red objects are large things or metal things?": ["how many red objects are large thing s or metal thing s"], "13_What number of red objects are either spheres or metal cubes?": ["what number of red objects are either sphere s or metal cube s"], "14_How many cyan objects are large things or rubber things?": ["how many cyan objects are large thing s or rubber thing s"], "15_How many rubber objects are either spheres or gray things?": ["how many rubber objects are either sphere s or gray thing s"], "16_How many rubber things are either cyan spheres or cylinders?": ["how many rubber thing s are either cyan sphere s or cylinder s"], "17_What number of metal objects are either cylinders or small things?": ["what number of metal objects are either cylinder s or small thing s"], "18_What number of metal things are cylinders or large things?": ["what number of metal thing s are cylinder s or large thing s"], "19_How many rubber things are either cylinders or small things?": ["how many rubber thing s are either cylinder s or small thing s"], "20_How many spheres are large things or metal things?": ["how many sphere s are large thing s or metal thing s"], "21_What number of cylinders are either large things or purple things?": ["what number of cylinder s are either large thing s or purple thing s"], "22_How many cylinders are large things or small things?": ["how many cylinder s are large thing s or small thing s"], "23_How many spheres are either large things or small things?": ["how many sphere s are either large thing s or small thing s"], "24_How many cubes are small purple things or rubber things?": ["how many cube s are small purple thing s or rubber thing s"]}