{"0-CLEVR_train_1_one_hop.json-How many things are right the large cylinder?": ["how many thing s are right the large cylinder"], "1-CLEVR_train_1_one_hop.json-What number of things are right the small gray thing?": ["what number of thing s are right the small gray thing"], "2-CLEVR_train_1_one_hop.json-How many large things are behind the large metal thing?": ["how many large thing s are behind the large metal thing"], "3-CLEVR_train_1_one_hop.json-What number of large cylinders are left the green rubber thing?": ["what number of large cylinder s are left the green rubber thing"], "4-CLEVR_train_1_one_hop.json-There is a small purple rubber thing; what number of rubber cylinders are right it?": ["there is a small purple rubber thing what number of rubber cylinder s are right it"], "5-CLEVR_train_1_one_hop.json-There is a green thing; what number of things are front it?": ["there is a green thing what number of thing s are front it"], "6-CLEVR_train_1_one_hop.json-There is a thing that is right the cube; what is its size?": ["there is a thing that is right the cube what is its size"], "7-CLEVR_train_1_one_hop.json-There is a thing front the brown thing; how big is it?": ["there is a thing front the brown thing how big is it"], "8-CLEVR_train_1_one_hop.json-There is a metal thing that is behind the metal sphere; what size is it?": ["there is a metal thing that is behind the metal sphere what size is it"], "9-CLEVR_train_1_one_hop.json-There is a cube front the gray rubber thing; how big is it?": ["there is a cube front the gray rubber thing how big is it"], "10-CLEVR_train_1_one_hop.json-There is a metal cylinder right the small purple metal thing; what is its size?": ["there is a metal cylinder right the small purple metal thing what is its size"], "11-CLEVR_train_1_one_hop.json-What is the size of the metal thing front the sphere?": ["what is the size of the metal thing front the sphere"], "12-CLEVR_train_1_one_hop.json-What color is the thing that is behind the sphere?": ["what color is the thing that is behind the sphere"], "13-CLEVR_train_1_one_hop.json-What color is the thing that is behind the blue thing?": ["what color is the thing that is behind the blue thing"], "14-CLEVR_train_1_one_hop.json-What color is the metal thing left the gray thing?": ["what color is the metal thing left the gray thing"], "15-CLEVR_train_1_one_hop.json-The large thing left the small rubber thing is what color?": ["the large thing left the small rubber thing is what color"], "16-CLEVR_train_1_one_hop.json-The rubber thing that is right the large metal sphere is what color?": ["the rubber thing that is right the large metal sphere is what color"], "17-CLEVR_train_1_one_hop.json-What color is the small metal thing behind the small purple metal thing?": ["what color is the small metal thing behind the small purple metal thing"], "18-CLEVR_train_1_one_hop.json-What is the material of the thing left the cube?": ["what is the material of the thing left the cube"], "19-CLEVR_train_1_one_hop.json-What is the material of the cylinder that is left the small cube?": ["what is the material of the cylinder that is left the small cube"], "20-CLEVR_train_1_one_hop.json-There is a large thing that is left the large purple metal thing; what material is it?": ["there is a large thing that is left the large purple metal thing what material is it"], "21-CLEVR_train_1_one_hop.json-What is the thing that is front the brown thing made of?": ["what is the thing that is front the brown thing made of"], "22-CLEVR_train_1_one_hop.json-What is the material of the sphere right the small sphere?": ["what is the material of the sphere right the small sphere"], "23-CLEVR_train_1_one_hop.json-There is a large thing behind the small gray thing; what is its material?": ["there is a large thing behind the small gray thing what is its material"], "24-CLEVR_train_1_one_hop.json-There is a thing that is right the cube; what shape is it?": ["there is a thing that is right the cube what shape is it"], "25-CLEVR_train_1_one_hop.json-What is the shape of the metal thing that is behind the sphere?": ["what is the shape of the metal thing that is behind the sphere"], "26-CLEVR_train_1_one_hop.json-There is a rubber thing front the large cylinder; what shape is it?": ["there is a rubber thing front the large cylinder what shape is it"], "27-CLEVR_train_1_one_hop.json-There is a large thing front the small metal cube; what is its shape?": ["there is a large thing front the small metal cube what is its shape"], "28-CLEVR_train_1_one_hop.json-What is the shape of the large rubber thing left the large rubber cylinder?": ["what is the shape of the large rubber thing left the large rubber cylinder"], "29-CLEVR_train_1_one_hop.json-What is the shape of the large rubber thing that is left the small red metal thing?": ["what is the shape of the large rubber thing that is left the small red metal thing"]}