{"0_What if the yellow thing became a small blue cube?": ["what if the yellow thing became a small blue cube"], "1_What if the metal cylinder became a green rubber thing?": ["what if the metal cylinder became a green rubber thing"], "2_What if the small brown thing became a large blue rubber cylinder?": ["what if the small brown thing became a large blue rubber cylinder"], "3_What if the yellow thing became a cylinder?": ["what if the yellow thing became a cylinder"], "4_What if the gray thing became a small cube?": ["what if the gray thing became a small cube"], "5_What if the metal cube became a sphere?": ["what if the metal cube became a sphere"], "6_What if the small brown thing became a cube?": ["what if the small brown thing became a cube"], "7_What if the metal sphere became a cyan rubber thing?": ["what if the metal sphere became a cyan rubber thing"], "8_What if the large gray thing became a small cyan metal cube?": ["what if the large gray thing became a small cyan metal cube"], "9_What if the large sphere became a rubber cube?": ["what if the large sphere became a rubber cube"], "10_What if the rubber cylinder became a yellow metal thing?": ["what if the rubber cylinder became a yellow metal thing"], "11_What if the large sphere became a small cylinder?": ["what if the large sphere became a small cylinder"], "12_What if all the red metal things became large cyan rubber things?": ["what if all the red metal thing s became large cyan rubber thing s"], "13_What if all the metal spheres became large cylinders?": ["what if all the metal sphere s became large cylinder s"], "14_What if all the small green things became large cylinders?": ["what if all the small green thing s became large cylinder s"], "15_What if all the large rubber cubes became small blue metal spheres?": ["what if all the large rubber cube s became small blue metal sphere s"], "16_What if all the rubber spheres became large green things?": ["what if all the rubber sphere s became large green thing s"], "17_What if all the large things became cylinders?": ["what if all the large thing s became cylinder s"], "18_What if all the small brown things became large rubber cubes?": ["what if all the small brown thing s became large rubber cube s"], "19_What if all the small metal cylinders became large things?": ["what if all the small metal cylinder s became large thing s"], "20_What if all the small cyan things became large things?": ["what if all the small cyan thing s became large thing s"], "21_What if all the rubber spheres became large gray metal cubes?": ["what if all the rubber sphere s became large gray metal cube s"], "22_What if all the purple things became green things?": ["what if all the purple thing s became green thing s"], "23_What if all the large cyan things became red things?": ["what if all the large cyan thing s became red thing s"], "24_If all of the large purple things became yellow, how many yellow things would there be?": ["if all of the large purple thing s became yellow how many yellow thing s would there be"], "25_If all of the large things became purple, how many purple things would there be?": ["if all of the large thing s became purple how many purple thing s would there be"], "26_If all of the green spheres became brown, how many brown things would there be?": ["if all of the green sphere s became brown how many brown thing s would there be"], "27_If all of the large purple things became blue, how many blue things would there be?": ["if all of the large purple thing s became blue how many blue thing s would there be"], "28_If all of the large metal cubes became yellow, how many yellow things would there be?": ["if all of the large metal cube s became yellow how many yellow thing s would there be"], "29_If all of the large metal cubes became brown, how many brown things would there be?": ["if all of the large metal cube s became brown how many brown thing s would there be"], "30_If all of the red metal things became cyan, how many cyan things would there be?": ["if all of the red metal thing s became cyan how many cyan thing s would there be"], "31_If all of the brown metal things became purple, how many purple things would there be?": ["if all of the brown metal thing s became purple how many purple thing s would there be"], "32_If all of the small rubber spheres became gray, how many gray things would there be?": ["if all of the small rubber sphere s became gray how many gray thing s would there be"], "33_If all of the cyan spheres became green, how many green things would there be?": ["if all of the cyan sphere s became green how many green thing s would there be"], "34_If all of the brown cylinders became gray, how many gray things would there be?": ["if all of the brown cylinder s became gray how many gray thing s would there be"], "35_If all of the small rubber spheres became red, how many red things would there be?": ["if all of the small rubber sphere s became red how many red thing s would there be"], "36_If all of the yellow things became brown cylinders, how many brown cylinders would there be?": ["if all of the yellow thing s became brown cylinder s how many brown cylinder s would there be"], "37_If all of the green metal things became purple cylinders, how many purple cylinders would there be?": ["if all of the green metal thing s became purple cylinder s how many purple cylinder s would there be"], "38_If all of the yellow metal things became purple cubes, how many purple cubes would there be?": ["if all of the yellow metal thing s became purple cube s how many purple cube s would there be"], "39_If all of the green cubes became purple spheres, how many purple spheres would there be?": ["if all of the green cube s became purple sphere s how many purple sphere s would there be"], "40_If all of the large cubes became red cylinders, how many red cylinders would there be?": ["if all of the large cube s became red cylinder s how many red cylinder s would there be"], "41_If all of the yellow metal things became blue spheres, how many blue spheres would there be?": ["if all of the yellow metal thing s became blue sphere s how many blue sphere s would there be"], "42_If all of the red rubber things became purple cubes, how many purple cubes would there be?": ["if all of the red rubber thing s became purple cube s how many purple cube s would there be"], "43_If all of the large green things became yellow cubes, how many yellow cubes would there be?": ["if all of the large green thing s became yellow cube s how many yellow cube s would there be"], "44_If all of the small yellow metal things became brown spheres, how many brown spheres would there be?": ["if all of the small yellow metal thing s became brown sphere s how many brown sphere s would there be"], "45_If all of the gray metal things became cyan cylinders, how many cyan cylinders would there be?": ["if all of the gray metal thing s became cyan cylinder s how many cyan cylinder s would there be"], "46_If all of the small metal cubes became brown spheres, how many brown spheres would there be?": ["if all of the small metal cube s became brown sphere s how many brown sphere s would there be"], "47_If all of the things became red cubes, how many red cubes would there be?": ["if all of the thing s became red cube s how many red cube s would there be"], "48_If all of the large yellow metal things became small, how many large things would there be?": ["if all of the large yellow metal thing s became small how many large thing s would there be"], "49_If all of the large gray things became small, how many large things would there be?": ["if all of the large gray thing s became small how many large thing s would there be"], "50_If all of the large rubber spheres became small, how many large things would there be?": ["if all of the large rubber sphere s became small how many large thing s would there be"], "51_If all of the small purple rubber things became large, how many small things would there be?": ["if all of the small purple rubber thing s became large how many small thing s would there be"], "52_If all of the small metal spheres became small, how many small things would there be?": ["if all of the small metal sphere s became small how many small thing s would there be"], "53_If all of the large metal cylinders became large, how many large things would there be?": ["if all of the large metal cylinder s became large how many large thing s would there be"], "54_If all of the small brown cubes became small, how many small things would there be?": ["if all of the small brown cube s became small how many small thing s would there be"], "55_If all of the small cylinders became large, how many small things would there be?": ["if all of the small cylinder s became large how many small thing s would there be"], "56_If all of the small metal things became large, how many small things would there be?": ["if all of the small metal thing s became large how many small thing s would there be"], "57_If all of the large green cubes became small, how many large things would there be?": ["if all of the large green cube s became small how many large thing s would there be"], "58_If all of the small green metal things became large, how many small things would there be?": ["if all of the small green metal thing s became large how many small thing s would there be"], "59_If all of the small rubber cylinders became large, how many small things would there be?": ["if all of the small rubber cylinder s became large how many small thing s would there be"]}