{"0_What if you removed all of the large blue things?": ["what if you removed all of the large blue thing s"], "1_What if you removed all of the gray metal things?": ["what if you removed all of the gray metal thing s"], "2_What if you removed all of the red things?": ["what if you removed all of the red thing s"], "3_What if you removed all of the purple things?": ["what if you removed all of the purple thing s"], "4_What if you removed all of the large gray rubber things?": ["what if you removed all of the large gray rubber thing s"], "5_What if you removed all of the red spheres?": ["what if you removed all of the red sphere s"], "6_What if you removed all of the blue cylinders?": ["what if you removed all of the blue cylinder s"], "7_What if you removed all of the small metal spheres?": ["what if you removed all of the small metal sphere s"], "8_What if you removed all of the cylinders?": ["what if you removed all of the cylinder s"], "9_What if you removed all of the small cyan things?": ["what if you removed all of the small cyan thing s"], "10_If you removed the small blue things, how many things would be left?": ["if you removed the small blue thing s how many thing s would be left"], "11_If you removed the green rubber things, how many things would be left?": ["if you removed the green rubber thing s how many thing s would be left"], "12_If you removed the large yellow rubber things, how many things would be left?": ["if you removed the large yellow rubber thing s how many thing s would be left"], "13_If you removed the small rubber cubes, how many things would be left?": ["if you removed the small rubber cube s how many thing s would be left"], "14_If you removed the large rubber cubes, how many things would be left?": ["if you removed the large rubber cube s how many thing s would be left"], "15_If you removed the spheres, how many things would be left?": ["if you removed the sphere s how many thing s would be left"], "16_If you removed the cyan spheres, how many things would be left?": ["if you removed the cyan sphere s how many thing s would be left"], "17_If you removed the large red metal things, how many things would be left?": ["if you removed the large red metal thing s how many thing s would be left"], "18_If you removed the green things, how many things would be left?": ["if you removed the green thing s how many thing s would be left"], "19_If you removed the large metal things, how many things would be left?": ["if you removed the large metal thing s how many thing s would be left"], "20_If you removed the green things, how many cylinders would be left?": ["if you removed the green thing s how many cylinder s would be left"], "21_If you removed the blue things, how many spheres would be left?": ["if you removed the blue thing s how many sphere s would be left"], "22_If you removed the blue things, how many cubes would be left?": ["if you removed the blue thing s how many cube s would be left"], "23_If you removed the red things, how many cubes would be left?": ["if you removed the red thing s how many cube s would be left"], "24_If you removed the brown things, how many cylinders would be left?": ["if you removed the brown thing s how many cylinder s would be left"], "25_If you removed the red things, how many cylinders would be left?": ["if you removed the red thing s how many cylinder s would be left"], "26_If you removed the yellow things, how many cylinders would be left?": ["if you removed the yellow thing s how many cylinder s would be left"], "27_If you removed the cyan things, how many cubes would be left?": ["if you removed the cyan thing s how many cube s would be left"], "28_If you removed the red things, how many spheres would be left?": ["if you removed the red thing s how many sphere s would be left"], "29_If you removed the gray things, how many cubes would be left?": ["if you removed the gray thing s how many cube s would be left"], "30_If you removed the cylinders, how many small things would be left?": ["if you removed the cylinder s how many small thing s would be left"], "31_If you removed the cubes, how many small things would be left?": ["if you removed the cube s how many small thing s would be left"], "32_If you removed the cylinders, how many large things would be left?": ["if you removed the cylinder s how many large thing s would be left"], "33_If you removed the spheres, how many small things would be left?": ["if you removed the sphere s how many small thing s would be left"], "34_If you removed the spheres, how many large things would be left?": ["if you removed the sphere s how many large thing s would be left"], "35_If you removed the cubes, how many large things would be left?": ["if you removed the cube s how many large thing s would be left"], "36_If you removed the green spheres, how many spheres would be left?": ["if you removed the green sphere s how many sphere s would be left"], "37_If you removed the blue cubes, how many cubes would be left?": ["if you removed the blue cube s how many cube s would be left"], "38_If you removed the brown cylinders, how many cylinders would be left?": ["if you removed the brown cylinder s how many cylinder s would be left"], "39_If you removed the cyan spheres, how many spheres would be left?": ["if you removed the cyan sphere s how many sphere s would be left"], "40_If you removed the red spheres, how many spheres would be left?": ["if you removed the red sphere s how many sphere s would be left"], "41_If you removed the red cubes, how many cubes would be left?": ["if you removed the red cube s how many cube s would be left"], "42_If you removed the gray cubes, how many cubes would be left?": ["if you removed the gray cube s how many cube s would be left"], "43_If you removed the blue cylinders, how many cylinders would be left?": ["if you removed the blue cylinder s how many cylinder s would be left"], "44_If you removed the green cubes, how many cubes would be left?": ["if you removed the green cube s how many cube s would be left"], "45_If you removed the purple cubes, how many cubes would be left?": ["if you removed the purple cube s how many cube s would be left"]}