{"0_How many small rubber cylinders are there?": ["how many small rubber cylinder s are there"], "1_How many small metal things are there?": ["how many small metal thing s are there"], "2_What number of metal things are there?": ["what number of metal thing s are there"], "3_How many cylinders are there?": ["how many cylinder s are there"], "4_How many small things are there?": ["how many small thing s are there"], "5_What number of large things are there?": ["what number of large thing s are there"], "6_What is the shape of the small blue thing?": ["what is the shape of the small blue thing"], "7_What is the shape of the purple metal thing?": ["what is the shape of the purple metal thing"], "8_What is the shape of the small purple thing?": ["what is the shape of the small purple thing"], "9_What is the shape of the small purple metal thing?": ["what is the shape of the small purple metal thing"], "10_What shape is the brown thing?": ["what shape is the brown thing"], "11_The red thing is what shape?": ["the red thing is what shape"], "12_What material is the large cube?": ["what material is the large cube"], "13_What material is the purple thing?": ["what material is the purple thing"], "14_What material is the small sphere?": ["what material is the small sphere"], "15_What is the brown cube made of?": ["what is the brown cube made of"], "16_What is the material of the small gray thing?": ["what is the material of the small gray thing"], "17_What material is the red thing?": ["what material is the red thing"], "18_What color is the cube?": ["what color is the cube"], "19_What color is the small rubber cylinder?": ["what color is the small rubber cylinder"], "20_What color is the rubber cylinder?": ["what color is the rubber cylinder"], "21_The rubber cube is what color?": ["the rubber cube is what color"], "22_What is the color of the large sphere?": ["what is the color of the large sphere"], "23_What is the color of the metal cylinder?": ["what is the color of the metal cylinder"], "24_What is the size of the yellow thing?": ["what is the size of the yellow thing"], "25_The blue thing is what size?": ["the blue thing is what size"], "26_The rubber sphere is what size?": ["the rubber sphere is what size"], "27_How big is the gray rubber thing?": ["how big is the gray rubber thing"], "28_The gray metal thing is what size?": ["the gray metal thing is what size"], "29_The cyan thing is what size?": ["the cyan thing is what size"]}