{"0_How many other things are the same size as the yellow thing?": ["how many other thing s are the same size as the yellow thing"], "1_How many other things are there of the same size as the brown thing?": ["how many other thing s are there of the same size as the brown thing"], "2_What number of other objects are there of the same size as the purple thing?": ["what number of other objects are there of the same size as the purple thing"], "3_How many other objects are the same color as the large cube?": ["how many other objects are the same color as the large cube"], "4_What number of other objects are the same color as the metal cube?": ["what number of other objects are the same color as the metal cube"], "5_How many other things are the same color as the cube?": ["how many other thing s are the same color as the cube"], "6_How many things have the same material as the large cube?": ["how many thing s have the same material as the large cube"], "7_What number of other cubes have the same material as the large cube?": ["what number of other cube s have the same material as the large cube"], "8_How many small things have the same material as the large cube?": ["how many small thing s have the same material as the large cube"], "9_What number of other things have the same shape as the cyan thing?": ["what number of other thing s have the same shape as the cyan thing"], "10_How many other large things are the same shape as the brown thing?": ["how many other large thing s are the same shape as the brown thing"], "11_How many other metal things are the same shape as the green thing?": ["how many other metal thing s are the same shape as the green thing"], "12_What shape is the gray thing that is the same size as the cyan thing?": ["what shape is the gray thing that is the same size as the cyan thing"], "13_What shape is the metal thing that is the same size as the metal cube?": ["what shape is the metal thing that is the same size as the metal cube"], "14_What is the shape of the metal thing that is the same size as the metal cylinder?": ["what is the shape of the metal thing that is the same size as the metal cylinder"], "15_There is a thing that is the same color as the small cylinder; what is its material?": ["there is a thing that is the same color as the small cylinder; what is its material"], "16_There is a large thing that is the same color as the metal cube; what is it made of?": ["there is a large thing that is the same color as the metal cube; what is it made of"], "17_What material is the small thing that is the same color as the metal cylinder?": ["what material is the small thing that is the same color as the metal cylinder"]}