{"0_How many metal things are there?": ["how many metal thing s are there"], "1_What number of large things are there?": ["what number of large thing s are there"], "2_How many rubber cylinders are there?": ["how many rubber cylinder s are there"], "3_What number of gray rubber cubes are there?": ["what number of gray rubber cube s are there"], "4_What number of small metal cubes are there?": ["what number of small metal cube s are there"], "5_How many small things are there?": ["how many small thing s are there"], "6_There is a yellow thing; what shape is it?": ["there is a yellow thing what shape is it"], "7_What is the shape of the brown thing?": ["what is the shape of the brown thing"], "8_What is the shape of the purple thing?": ["what is the shape of the purple thing"], "9_What is the shape of the small yellow thing?": ["what is the shape of the small yellow thing"], "10_What is the shape of the small purple thing?": ["what is the shape of the small purple thing"], "11_What is the shape of the blue metal thing?": ["what is the shape of the blue metal thing"], "12_What is the purple thing made of?": ["what is the purple thing made of"], "13_What material is the gray thing?": ["what material is the gray thing"], "14_What material is the purple cylinder?": ["what material is the purple cylinder"], "15_What is the gray cube made of?": ["what is the gray cube made of"], "16_What is the small blue cube made of?": ["what is the small blue cube made of"], "17_What material is the small yellow thing?": ["what material is the small yellow thing"], "18_The cube is what color?": ["the cube is what color"], "19_What color is the metal sphere?": ["what color is the metal sphere"], "20_What is the color of the rubber cube?": ["what is the color of the rubber cube"], "21_The large cube is what color?": ["the large cube is what color"], "22_The rubber cube is what color?": ["the rubber cube is what color"], "23_The large metal thing has what color?": ["the large metal thing has what color"], "24_What is the size of the gray thing?": ["what is the size of the gray thing"], "25_What is the size of the gray sphere?": ["what is the size of the gray sphere"], "26_The green thing has what size?": ["the green thing has what size"], "27_The gray metal thing has what size?": ["the gray metal thing has what size"], "28_The brown metal thing has what size?": ["the brown metal thing has what size"], "29_The brown thing is what size?": ["the brown thing is what size"]}