{"0_There is a metal sphere; what number of things are behind it?": ["there is a metal sphere; what number of thing s are behind it"], "1_What number of things are left the cylinder?": ["what number of thing s are left the cylinder"], "2_There is a small green thing; how many small things are right it?": ["there is a small green thing; how many small thing s are right it"], "3_What number of spheres are front the small sphere?": ["what number of sphere s are front the small sphere"], "4_What number of large things are left the gray thing?": ["what number of large thing s are left the gray thing"], "5_There is a cyan thing; are there any spheres right it?": ["there is a cyan thing; are there any sphere s right it"], "6_There is a cyan thing; are there any large rubber things left it?": ["there is a cyan thing; are there any large rubber thing s left it"], "7_Are there any rubber things left the cyan thing?": ["are there any rubber thing s left the cyan thing"], "8_There is a cyan thing; are there any rubber things behind it?": ["there is a cyan thing; are there any rubber thing s behind it"], "9_There is a red thing; are there any things front it?": ["there is a red thing; are there any thing s front it"], "10_There is a cylinder that is left the red cube; what size is it?": ["there is a cylinder that is left the red cube; what size is it"], "11_What size is the cube behind the large metal cube?": ["what size is the cube behind the large metal cube"], "12_There is a metal thing right the rubber sphere; how big is it?": ["there is a metal thing right the rubber sphere; how big is it"], "13_There is a rubber thing that is left the rubber sphere; how big is it?": ["there is a rubber thing that is left the rubber sphere; how big is it"], "14_What size is the thing front the brown thing?": ["what size is the thing front the brown thing"], "15_What color is the large thing that is front the large metal sphere?": ["what color is the large thing that is front the large metal sphere"], "16_There is a cube left the metal cube; what is its color?": ["there is a cube left the metal cube; what is its color"], "17_There is a small rubber thing that is behind the gray cylinder; what is its color?": ["there is a small rubber thing that is behind the gray cylinder; what is its color"], "18_There is a small metal thing behind the large rubber cube; what is its color?": ["there is a small metal thing behind the large rubber cube; what is its color"], "19_There is a rubber thing that is front the small rubber cube; what is its color?": ["there is a rubber thing that is front the small rubber cube; what is its color"], "20_What is the large thing left the gray rubber thing made of?": ["what is the large thing left the gray rubber thing made of"], "21_What is the material of the large thing right the large green thing?": ["what is the material of the large thing right the large green thing"], "22_There is a small cube front the red thing; what material is it?": ["there is a small cube front the red thing; what material is it"], "23_What is the material of the large thing that is left the green rubber thing?": ["what is the material of the large thing that is left the green rubber thing"], "24_There is a large thing left the small cylinder; what is it made of?": ["there is a large thing left the small cylinder; what is it made of"], "25_There is a rubber thing front the large metal cube; what shape is it?": ["there is a rubber thing front the large metal cube; what shape is it"], "26_What shape is the small metal thing right the metal cube?": ["what shape is the small metal thing right the metal cube"], "27_What is the shape of the metal thing behind the purple metal thing?": ["what is the shape of the metal thing behind the purple metal thing"], "28_What is the shape of the large thing front the large sphere?": ["what is the shape of the large thing front the large sphere"], "29_There is a large thing behind the small blue thing; what is its shape?": ["there is a large thing behind the small blue thing; what is its shape"]}