{"0_There is a metal sphere; what number of spheres are right it?": ["there is a metal sphere; what number of sphere s are right it"], "1_There is a purple thing; how many rubber things are left it?": ["there is a purple thing; how many rubber thing s are left it"], "2_There is a red thing; how many small things are behind it?": ["there is a red thing; how many small thing s are behind it"], "3_What number of cylinders are right the small cylinder?": ["what number of cylinder s are right the small cylinder"], "4_How many small things are front the small cylinder?": ["how many small thing s are front the small cylinder"], "5_There is a rubber cylinder; are there any things behind it?": ["there is a rubber cylinder; are there any thing s behind it"], "6_There is a rubber cylinder; are there any cylinders left it?": ["there is a rubber cylinder; are there any cylinder s left it"], "7_Are there any cylinders behind the rubber cylinder?": ["are there any cylinder s behind the rubber cylinder"], "8_Are there any rubber things behind the rubber cylinder?": ["are there any rubber thing s behind the rubber cylinder"], "9_Are there any rubber things behind the small rubber thing?": ["are there any rubber thing s behind the small rubber thing"], "10_There is a metal thing that is behind the cyan thing; what size is it?": ["there is a metal thing that is behind the cyan thing; what size is it"], "11_There is a metal thing behind the large rubber cube; how big is it?": ["there is a metal thing behind the large rubber cube; how big is it"], "12_How big is the metal thing that is left the metal cube?": ["how big is the metal thing that is left the metal cube"], "13_There is a metal thing that is front the metal sphere; how big is it?": ["there is a metal thing that is front the metal sphere; how big is it"], "14_There is a rubber thing right the rubber cylinder; what is its size?": ["there is a rubber thing right the rubber cylinder; what is its size"], "15_What is the color of the large rubber thing that is left the large rubber cylinder?": ["what is the color of the large rubber thing that is left the large rubber cylinder"], "16_The small thing that is front the small yellow thing is what color?": ["the small thing that is front the small yellow thing is what color"], "17_The large thing that is behind the large cube is what color?": ["the large thing that is behind the large cube is what color"], "18_There is a sphere that is right the small metal sphere; what is its color?": ["there is a sphere that is right the small metal sphere; what is its color"], "19_There is a large thing behind the large metal thing; what is its color?": ["there is a large thing behind the large metal thing; what is its color"], "20_There is a cylinder right the small rubber cylinder; what is its material?": ["there is a cylinder right the small rubber cylinder; what is its material"], "21_There is a cylinder right the yellow thing; what is its material?": ["there is a cylinder right the yellow thing; what is its material"], "22_There is a large thing left the cyan thing; what is it made of?": ["there is a large thing left the cyan thing; what is it made of"], "23_There is a cylinder that is left the small metal cylinder; what is its material?": ["there is a cylinder that is left the small metal cylinder; what is its material"], "24_There is a large thing that is right the large cylinder; what material is it?": ["there is a large thing that is right the large cylinder; what material is it"], "25_There is a small thing that is behind the small rubber thing; what is its shape?": ["there is a small thing that is behind the small rubber thing; what is its shape"], "26_There is a metal thing front the small metal cylinder; what is its shape?": ["there is a metal thing front the small metal cylinder; what is its shape"], "27_The small thing that is left the small sphere has what shape?": ["the small thing that is left the small sphere has what shape"], "28_What is the shape of the large thing right the large sphere?": ["what is the shape of the large thing right the large sphere"], "29_There is a small metal thing that is front the small metal sphere; what is its shape?": ["there is a small metal thing that is front the small metal sphere; what is its shape"]}