{"0_What if the yellow metal thing became a rubber thing?": ["what if the yellow metal thing became a rubber thing"], "1_What if the large rubber sphere became a metal cube?": ["what if the large rubber sphere became a metal cube"], "2_What if the cube became a gray rubber thing?": ["what if the cube became a gray rubber thing"], "3_What if the large metal cube became a small rubber sphere?": ["what if the large metal cube became a small rubber sphere"], "4_What if the brown rubber cylinder became a yellow metal thing?": ["what if the brown rubber cylinder became a yellow metal thing"], "5_What if the metal sphere became a rubber thing?": ["what if the metal sphere became a rubber thing"], "6_What if the large cube became a yellow cylinder?": ["what if the large cube became a yellow cylinder"], "7_What if the red thing became a purple metal thing?": ["what if the red thing became a purple metal thing"], "8_What if the brown thing became a green metal thing?": ["what if the brown thing became a green metal thing"], "9_What if the rubber cube became a yellow cylinder?": ["what if the rubber cube became a yellow cylinder"], "10_What if all the purple cubes became yellow rubber things?": ["what if all the purple cube s became yellow rubber thing s"], "11_What if all the large blue rubber cylinders became metal cubes?": ["what if all the large blue rubber cylinder s became metal cube s"], "12_What if all the blue metal cylinders became brown rubber cubes?": ["what if all the blue metal cylinder s became brown rubber cube s"], "13_What if all the small yellow things became large red rubber things?": ["what if all the small yellow thing s became large red rubber thing s"], "14_What if all the purple rubber things became small spheres?": ["what if all the purple rubber thing s became small sphere s"], "15_What if all the small purple rubber things became large metal things?": ["what if all the small purple rubber thing s became large metal thing s"], "16_What if all the brown metal cubes became purple things?": ["what if all the brown metal cube s became purple thing s"], "17_What if all the red cubes became small blue metal spheres?": ["what if all the red cube s became small blue metal sphere s"], "18_What if all the large red metal spheres became cubes?": ["what if all the large red metal sphere s became cube s"], "19_What if all the large purple metal things became small rubber things?": ["what if all the large purple metal thing s became small rubber thing s"], "20_If all of the purple metal spheres became cyan, how many cyan things would there be?": ["if all of the purple metal sphere s became cyan how many cyan thing s would there be"], "21_If all of the large yellow metal cubes became green, how many green things would there be?": ["if all of the large yellow metal cube s became green how many green thing s would there be"], "22_If all of the large cyan cubes became blue, how many blue things would there be?": ["if all of the large cyan cube s became blue how many blue thing s would there be"], "23_If all of the small brown cylinders became purple, how many purple things would there be?": ["if all of the small brown cylinder s became purple how many purple thing s would there be"], "24_If all of the small yellow rubber spheres became brown, how many brown things would there be?": ["if all of the small yellow rubber sphere s became brown how many brown thing s would there be"], "25_If all of the large gray spheres became red, how many red things would there be?": ["if all of the large gray sphere s became red how many red thing s would there be"], "26_If all of the small cubes became purple, how many purple things would there be?": ["if all of the small cube s became purple how many purple thing s would there be"], "27_If all of the large cyan rubber cylinders became brown, how many brown things would there be?": ["if all of the large cyan rubber cylinder s became brown how many brown thing s would there be"], "28_If all of the large gray cubes became cyan, how many cyan things would there be?": ["if all of the large gray cube s became cyan how many cyan thing s would there be"], "29_If all of the gray metal spheres became green, how many green things would there be?": ["if all of the gray metal sphere s became green how many green thing s would there be"], "30_If all of the large red rubber spheres became metal, how many metal things would there be?": ["if all of the large red rubber sphere s became metal how many metal thing s would there be"], "31_If all of the large red metal things became rubber, how many rubber things would there be?": ["if all of the large red metal thing s became rubber how many rubber thing s would there be"], "32_If all of the red metal things became rubber, how many rubber things would there be?": ["if all of the red metal thing s became rubber how many rubber thing s would there be"], "33_If all of the small blue spheres became metal, how many metal things would there be?": ["if all of the small blue sphere s became metal how many metal thing s would there be"], "34_If all of the gray rubber things became metal, how many metal things would there be?": ["if all of the gray rubber thing s became metal how many metal thing s would there be"], "35_If all of the small red rubber spheres became metal, how many metal things would there be?": ["if all of the small red rubber sphere s became metal how many metal thing s would there be"], "36_If all of the green things became rubber, how many rubber things would there be?": ["if all of the green thing s became rubber how many rubber thing s would there be"], "37_If all of the large brown metal cylinders became rubber, how many rubber things would there be?": ["if all of the large brown metal cylinder s became rubber how many rubber thing s would there be"], "38_If all of the large cyan spheres became rubber, how many rubber things would there be?": ["if all of the large cyan sphere s became rubber how many rubber thing s would there be"], "39_If all of the small red metal cubes became rubber, how many rubber things would there be?": ["if all of the small red metal cube s became rubber how many rubber thing s would there be"], "40_If all of the blue rubber spheres became cyan cylinders, how many cyan cylinders would there be?": ["if all of the blue rubber sphere s became cyan cylinder s how many cyan cylinder s would there be"], "41_If all of the blue metal cubes became yellow spheres, how many yellow spheres would there be?": ["if all of the blue metal cube s became yellow sphere s how many yellow sphere s would there be"], "42_If all of the small red rubber cubes became cyan cylinders, how many cyan cylinders would there be?": ["if all of the small red rubber cube s became cyan cylinder s how many cyan cylinder s would there be"], "43_If all of the small things became cyan cubes, how many cyan cubes would there be?": ["if all of the small thing s became cyan cube s how many cyan cube s would there be"], "44_If all of the large blue metal cubes became red spheres, how many red spheres would there be?": ["if all of the large blue metal cube s became red sphere s how many red sphere s would there be"], "45_If all of the small spheres became brown cylinders, how many brown cylinders would there be?": ["if all of the small sphere s became brown cylinder s how many brown cylinder s would there be"], "46_If all of the large red metal cylinders became yellow cubes, how many yellow cubes would there be?": ["if all of the large red metal cylinder s became yellow cube s how many yellow cube s would there be"], "47_If all of the small rubber cylinders became green cubes, how many green cubes would there be?": ["if all of the small rubber cylinder s became green cube s how many green cube s would there be"], "48_If all of the small red rubber things became gray cubes, how many gray cubes would there be?": ["if all of the small red rubber thing s became gray cube s how many gray cube s would there be"], "49_If all of the small yellow metal cylinders became blue spheres, how many blue spheres would there be?": ["if all of the small yellow metal cylinder s became blue sphere s how many blue sphere s would there be"], "50_If all of the large yellow spheres became small, how many large things would there be?": ["if all of the large yellow sphere s became small how many large thing s would there be"], "51_If all of the large metal spheres became small, how many large things would there be?": ["if all of the large metal sphere s became small how many large thing s would there be"], "52_If all of the small yellow cylinders became large, how many small things would there be?": ["if all of the small yellow cylinder s became large how many small thing s would there be"], "53_If all of the small purple metal spheres became small, how many small things would there be?": ["if all of the small purple metal sphere s became small how many small thing s would there be"], "54_If all of the large brown metal cylinders became small, how many large things would there be?": ["if all of the large brown metal cylinder s became small how many large thing s would there be"], "55_If all of the large gray rubber spheres became small, how many large things would there be?": ["if all of the large gray rubber sphere s became small how many large thing s would there be"], "56_If all of the large brown metal cylinders became large, how many large things would there be?": ["if all of the large brown metal cylinder s became large how many large thing s would there be"], "57_If all of the large gray rubber cubes became large, how many large things would there be?": ["if all of the large gray rubber cube s became large how many large thing s would there be"], "58_If all of the small blue things became large, how many small things would there be?": ["if all of the small blue thing s became large how many small thing s would there be"], "59_If all of the small blue rubber cubes became large, how many small things would there be?": ["if all of the small blue rubber cube s became large how many small thing s would there be"]}