{"0_How many things are cylinders or spheres?": ["how many thing s are cylinder s or sphere s"], "1_What number of objects are small things or metal things?": ["what number of objects are small thing s or metal thing s"], "2_How many things are either cylinders or rubber things?": ["how many thing s are either cylinder s or rubber thing s"], "3_What number of objects are either spheres or metal things?": ["what number of objects are either sphere s or metal thing s"], "4_What number of objects are either metal things or large things?": ["what number of objects are either metal thing s or large thing s"], "5_What number of large objects are cylinders or metal things?": ["what number of large objects are cylinder s or metal thing s"], "6_What number of small things are either metal things or rubber things?": ["what number of small thing s are either metal thing s or rubber thing s"], "7_How many large things are rubber things or metal things?": ["how many large thing s are rubber thing s or metal thing s"], "8_What number of large objects are either rubber things or cylinders?": ["what number of large objects are either rubber thing s or cylinder s"], "9_What number of large objects are either metal things or spheres?": ["what number of large objects are either metal thing s or sphere s"], "10_How many green objects are cubes or large things?": ["how many green objects are cube s or large thing s"], "11_How many yellow objects are either metal things or small things?": ["how many yellow objects are either metal thing s or small thing s"], "12_How many green things are metal things or small things?": ["how many green thing s are metal thing s or small thing s"], "13_How many green things are either metal things or spheres?": ["how many green thing s are either metal thing s or sphere s"], "14_What number of gray things are either metal things or small things?": ["what number of gray thing s are either metal thing s or small thing s"], "15_How many rubber things are either large things or cubes?": ["how many rubber thing s are either large thing s or cube s"], "16_How many rubber things are either cubes or large things?": ["how many rubber thing s are either cube s or large thing s"], "17_How many metal things are spheres or cubes?": ["how many metal thing s are sphere s or cube s"], "18_How many metal objects are small things or cubes?": ["how many metal objects are small thing s or cube s"], "19_What number of rubber things are either small things or cylinders?": ["what number of rubber thing s are either small thing s or cylinder s"], "20_How many spheres are small things or rubber things?": ["how many sphere s are small thing s or rubber thing s"], "21_What number of cubes are either rubber things or large things?": ["what number of cube s are either rubber thing s or large thing s"], "22_How many cubes are rubber things or metal things?": ["how many cube s are rubber thing s or metal thing s"], "23_What number of cubes are either large rubber things or small rubber things?": ["what number of cube s are either large rubber thing s or small rubber thing s"], "24_What number of cylinders are either small things or large things?": ["what number of cylinder s are either small thing s or large thing s"]}